---
kind: other
id: AllMembers.T:Autodesk.Revit.Exceptions.ModificationForbiddenException
source: html/7015a33a-4e43-97b4-b9a3-576978349930.htm
---
# ModificationForbiddenException Members

Retrieves data needed to serialize the target object.